{
  "model_type": "bert",
  "architectures": [
    "BertForPreTraining"
  ],
  "hidden_size": 768,
  "num_hidden_layers": 12,
  "num_attention_heads": 12,
  "intermediate_size": 3072,
  "hidden_act": "gelu",
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "type_vocab_size": 2,
  "vocab_size": 30522,
  "pad_token_id": 0,
  "attention_probs_dropout_prob": 0.1,
  "hidden_dropout_prob": 0.1,
  "use_cache": true
}
